AmazonS3/AmazonS3SoapBinding.SetBucketLoggingStatus.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://s3.amazonaws.com/doc/2006-03-01/">
 <SOAP-ENV:Body>
   <ns1:SetBucketLoggingStatus>
    <ns1:Bucket></ns1:Bucket>
    <ns1:AWSAccessKeyId></ns1:AWSAccessKeyId>
    <ns1:Timestamp>2012-07-12T14:05:58Z</ns1:Timestamp>
    <ns1:Signature></ns1:Signature>
    <ns1:Credential></ns1:Credential>
    <ns1:BucketLoggingStatus>
     <ns1:LoggingEnabled>
      <ns1:TargetBucket></ns1:TargetBucket>
      <ns1:TargetPrefix></ns1:TargetPrefix>
      <ns1:TargetGrants>
       <ns1:Grant>
        <ns1:Grantee>
        </ns1:Grantee>
        <ns1:Permission>READ</ns1:Permission>
       </ns1:Grant>
       <ns1:Grant>
        <ns1:Grantee>
        </ns1:Grantee>
        <ns1:Permission>READ</ns1:Permission>
       </ns1:Grant>
      </ns1:TargetGrants>
     </ns1:LoggingEnabled>
    </ns1:BucketLoggingStatus>
   </ns1:SetBucketLoggingStatus>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
